In [1]:
import pandas as pd

In [3]:
data = pd.read_csv('Iris.csv')

In [9]:
data.sum()

Id                                                           11325
SepalLengthCm                                                876.5
SepalWidthCm                                                 458.1
PetalLengthCm                                                563.8
PetalWidthCm                                                 179.8
Species          Iris-setosaIris-setosaIris-setosaIris-setosaIr...
dtype: object

In [10]:
# summary of data
data.describe()

               Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count  150.000000     150.000000    150.000000     150.000000    150.000000
mean    75.500000       5.843333      3.054000       3.758667      1.198667
std     43.445368       0.828066      0.433594       1.764420      0.763161
min      1.000000       4.300000      2.000000       1.000000      0.100000
25%     38.250000       5.100000      2.800000       1.600000      0.300000
50%     75.500000       5.800000      3.000000       4.350000      1.300000
75%    112.750000       6.400000      3.300000       5.100000      1.800000
max    150.000000       7.900000      4.400000       6.900000      2.500000

In [11]:
data.agg(['sum', 'max', 'min'])

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
sum,11325,876.5,458.1,563.8,179.8,Iris-setosaIris-setosaIris-setosaIris-setosaIr...
max,150,7.9,4.4,6.9,2.5,Iris-virginica
min,1,4.3,2.0,1.0,0.1,Iris-setosa

In [12]:
# Grouping
data = {
    'Item': ['Cake', 'Cake', 'Bread', 'Pastry', 'Cake'],
    'Flavor': ['Chocolate', 'Vanilla', 'Whole Wheat', 'Strawberry', 'Chocolate'],
    'Price': [250, 220, 80, 120, 250]
}

df = pd.DataFrame(data)

In [13]:
df

     Item       Flavor  Price
0    Cake    Chocolate    250
1    Cake      Vanilla    220
2   Bread  Whole Wheat     80
3  Pastry   Strawberry    120
4    Cake    Chocolate    250

In [15]:
df.groupby('Item')

In [18]:
df.groupby('Item')['Price'].sum()

Item
Bread      80
Cake      720
Pastry    120
Name: Price, dtype: int64

In [19]:
df.groupby(['Item', 'Flavor']).sum()

                    Price
Item   Flavor
Bread  Whole Wheat     80
Cake   Chocolate      500
       Vanilla        220
Pastry Strawberry     120